{"q_id": "qbt9gg", "title": "ELI5: why cant america just ban guns", "selftext": "feels like it would solve alot of problems", "subreddit": "explainlikeimfive", "url": "https://www.reddit.com/r/explainlikeimfive/comments/qbt9gg/eli5_why_cant_america_just_ban_guns/", "score": "1", "category": "Other", "date": "2021-10-20 04:54:52", "comments": {"6": ["For the same reason you can’t ban free speech.  It is a constitutional freedom that was designed to be difficult dismantle."], "4": ["First, because the 2nd Amendment to the Constitution is higher than law - laws cannot contradict the Constitution. That said, the exact meaning of the 2nd Amendment and its relation to whatever type of ban you're talking about is up for debate, so the more real answer is:@@@@@@Second, because a large percentage of Americans dont want it. Probably a majority are against \"banning all guns\", but enough oppose *any* sort of gun restrictions to stop any laws about it from being passed at the federal level. In fully blue states, there still just isn't the desire in the public or in state governments to ban all gun ownership, even if it was constitutional."], "3": ["If bans worked, then by that logic America would have no crime, no drugs, and no graffitti. You can ban whatever you want, but people who want to do bad don't seem to follow rules all that well."], "2": ["Well the second amendment has a long history of being read as if we didn’t have a standing Federal Military. Then there is the logistics of purchasing back all of the guns, and if you owned the guns before the law took effect they would be grandfathered in. Banning firearms would be a decades long and multi-trillion dollar endeavor.", "Canada is a lot safer. There is no tyranny. The only gun crime is mostly imported from the US. Statistics is clear, but statistic don't move people emotionally, just like covid stats don't move antivaxxer who's set in their way of thinking."], "1": ["Because that is against our constitution. The right to bear arms against tyranny, especially in the context it's own government being the tyrant is one of our rights. Besides, banning drugs and alcohol didn't stop people from using them, so why would banning guns actually work in the first place? It would only stop the law abiding citizens from defense against those who aren't. Unfortunately, things aren't as cut and dry as you would like to believe.", "For one… it’s very illegal. It’s a constitutional right, second only to freedom of the press. The only way to do so would be another amendment, and I think it would be no exaggeration to say the population would be *up in arms* about it.@@@@@@There’s also the technicality of once you’ve banned all those guns, how are you going to get them from the people? Sure some would probably turn them in, buyback programs would get some more, but what about the rest? That’d be a lot of shooting to pull that off.@@@@@@There’s also the issue that banning guns won’t get rid of them. Firearms is a huge industry, and there’s a lot of demand. Just because people couldn’t buy them in stores doesn’t mean they wouldn’t get into the country. And I’d also argue that many of the people motivated enough to carry out murders would find a way to do it without one. If they’re motivated enough for mass shootings, they’ll figure out how to get the guns anyway, or make a bomb instead.@@@@@@Finally, if you think tracking firearms can be troublesome now, imagine once they’re banned. No registries (because they wouldn’t be needed) makes it a lot harder to trace ownership and sourcing. Not something law enforcement would be thrilled to deal with I think.@@@@@@Yes, sometimes there are problems with guns. I’m not denying it. But I firmly believe banning guns wouldn’t solve very much, and might actually inflame a few issues.", "3 reasons. Formost it's the same reason we can't just ban hard drugs. I mean, cocaine is illegal ... but drugs are here anyway and criminals are still avoiding the law to sell them. So gang crime would be unaffected. Number two, there's good arguments for their use in personal protection. Third is a bit of a two-parter. Americans have a strong sense that they should be able to do something if it doesn't hurt anyone else. Coupled with the fact that the government is Constitutionally barred from simply taking away person property without the owner misusing it first, that means the government can only legally take guns away from criminals."], "0": ["Because it would be a terrible idea. The vast majority - like 99.9% of gun owners are no problem at all. The 2nd Amendment exists as a hedge against a tyrannical government, and that’s very important as government gets bigger and bigger. Then of course there’s hunting and other sporting uses for firearms as well."]}, "filename": "Law.jsonl", "prefix": "Q: why cant america just ban guns\nA:", "gold_completion": "For the same reason you can’t ban free speech.  It is a constitutional freedom that was designed to be difficult dismantle."}
{"q_id": "oy1w8p", "title": "ELI5: Why do \"at-will\" employment states have probation periods at work?", "selftext": "Being  from Europe, where one-month (or more) notice periods are the norm in employment, I understand the concept of a probation period being to have  a simple way to end an employment contract in the first few months if it becomes apparent that  the person employed is under-qualified or incompetent, if the job was mis-advertised, or for various other reasons. However recently I came across a question which mentioned that somebody was in their probation period in what I  then found out was an \"at-will\" state for employment (ie the worker can be dismissed at any time without reason).@@@@@@In such a state, where somebody could be fired at any time, what purpose does the probation period serve, and why would somebody be wary of causing issues during it which they wouldn't be after it is over?@@@@@@(I  found a similar question but it seemed to be more about whether there  is an effect on \"at-will\" employment rather than why probation exists at  all)", "subreddit": "explainlikeimfive", "url": "https://www.reddit.com/r/explainlikeimfive/comments/oy1w8p/eli5_why_do_atwill_employment_states_have/", "score": "1", "category": "Other", "date": "2021-08-04 20:43:48", "comments": {"4": ["In most cases, employees do not get access to many of the company's benefits, such as accruing vacation/sick leave, retirement plan contributions, or other perks. So it's less about having an \"out\" for the company to let go an unsatisfactory employee, but saving money on them by not giving them full compensation till they \"prove\" themselves."], "2": ["At-will states can still have employers and employees agree contractually to things like notice periods, they just aren't legally obligated to. But if it says in your contract that termination will be given with X days notice, then it has to be. This is generally the case with labour laws - they define minimums, not maximums. @@@@@@This is one reason why a probationary period may exist."]}, "filename": "Law.jsonl", "prefix": "Q: Why do \"at-will\" employment states have probation periods at work?\nA:", "gold_completion": "In most cases, employees do not get access to many of the company's benefits, such as accruing vacation/sick leave, retirement plan contributions, or other perks. So it's less about having an \"out\" for the company to let go an unsatisfactory employee, but saving money on them by not giving them full compensation till they \"prove\" themselves."}
{"q_id": "plyty3", "title": "ELI5: What’s the difference between something being unlawful and something being illegal?", "selftext": "", "subreddit": "explainlikeimfive", "url": "https://www.reddit.com/r/explainlikeimfive/comments/plyty3/eli5_whats_the_difference_between_something_being/", "score": "1", "category": "Other", "date": "2021-09-11 02:23:44", "comments": {"1": ["To some degree, those are synonyms.@@@@@@Loosely but not in any strict legal sense, “illegal” more often refers to an action that constitutes a crime — a violation of the law that can subject the actor to criminal prosecution by the government, leading to a conviction, a criminal record, and potentially a custodial sentence.@@@@@@Loosely but not in any strict legal sense, “unlawful” more often refers to an action that constitutes any contravention of any law, even if that contravention of the law cannot lead to criminal penalties. Some common examples of something unlawful but not criminal might include committing a civil wrong against a person (say, breaking your lease), or being late in paying a fine, or remaining in the country without legal status.@@@@@@When the government itself fails to comply with a statute or regulation, that too is more likely to be termed “unlawful” than “illegal.”", "For me the distinction would be that illegal is anything in direct violation of a specific law. @@@@@@Unlawful would be a description of a persons disregard for laws in general.", "They’re used interchangeably but there’s a difference. @@@@@@An act is illegal if there is a specific law that that act violates.  Murder is illegal, there is a law against it.  @@@@@@An act is unlawful if it violates a general law of society even if it does not violate any specific law.  Listening to loud music on a city bus is unlawful.@@@@@@Unlawful is closer to “prohibited”."], "0": ["There is absolutely no difference, whatsoever.  The dictionary definitions of both of those words makes it quite clear that they are synonyms.", "It's basically semantics.  Illegal means you are held accountable for unlawful actions.  Unlawful means you aren't held accountable despite the written law."]}, "filename": "Law.jsonl", "prefix": "Q: What’s the difference between something being unlawful and something being illegal?\nA:", "gold_completion": "To some degree, those are synonyms.\nLoosely but not in any strict legal sense, “illegal” more often refers to an action that constitutes a crime — a violation of the law that can subject the actor to criminal prosecution by the government, leading to a conviction, a criminal record, and potentially a custodial sentence.\nLoosely but not in any strict legal sense, “unlawful” more often refers to an action that constitutes any contravention of any law, even if that contravention of the law cannot lead to criminal penalties. Some common examples of something unlawful but not criminal might include committing a civil wrong against a person (say, breaking your lease), or being late in paying a fine, or remaining in the country without legal status.\nWhen the government itself fails to comply with a statute or regulation, that too is more likely to be termed “unlawful” than “illegal.”"}